mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
// MeshCore `.mota` delta-apply for the nRF52 bootloader (single-slot, detools in-place).
// See ota_delta.h for the contract. Compiles for the device (nrfx/SDK) and for a host test harness
// (OTA_DELTA_HOST_TEST: the test TU provides the otah_* flash/settings/gpregret stubs + crc16).
#include "ota_delta.h"
#include "ota_layout.h"
#include "ota_bl_info.h"
#if defined(MOTA_SD_CARD)
#include "ota_sd_handoff.h"
#include "ota_sd_spi.h"
#endif
#include "detools/detools.h"
#include <string.h>
#include <stdint.h>

// Capability marker the running MeshCore app scans for (see ota_bl_info.h). `used` + the reference in
// ota_delta_check_and_apply() keep it through -ffunction/data-sections, --gc-sections and -flto.
__attribute__((used)) const mota_bl_info_t g_mota_bl_info = {
  { MOTA_BL_MAGIC0, MOTA_BL_MAGIC1, MOTA_BL_MAGIC2, MOTA_BL_MAGIC3,
    MOTA_BL_MAGIC4, MOTA_BL_MAGIC5, MOTA_BL_MAGIC6, MOTA_BL_MAGIC7 },
  MOTA_BL_APPLY_ABI,
#if defined(MOTA_SD_CARD)
  (uint16_t)((1u << 0) | (1u << 2)),   // SD: full images and in-place deltas
  { 1, 0, 0, 0 },                      // storage flag bit 0 = SD handoff
#else
  (uint16_t)(1u << 2),                 // internal flash: in-place deltas only
  { 0, 0, 0, 0 },
#endif
};

// ---- `.mota` / EndF on-wire constants (mirror of src/helpers/ota/OtaFormat.h, C-friendly) ---------
static const uint8_t MAGIC[4]    = { 'm','O','T','A' };
static const uint8_t TRAILER[5]  = { 'v','k','4','9','6' };
static const uint8_t ENDF[4]     = { 'E','n','d','F' };
static const uint8_t APRV[4]     = { 'A','P','R','V' };
#define ENDF_LEN          56u    // fixed trailer: marker(4)+body_len(4)+body_hash8(8)+fw_ver(4)+target(4)+hw_id(32)
#define MOTA_MFL          197u   // fixed manifest-minus-leaves length (head 89 + base_hash 8 + signer 32 + sig 64 + approval 4)
#define MFLAG_FULL        0x01u
#define MFLAG_SIGNED      0x02u
#define CODEC_FULL        0u
#define CODEC_INPLACE     2u
#define PAGE              MOTA_NRF52_FLASH_PAGE
#if defined(MOTA_SD_CARD)
  #define APP_LIMIT       MOTA_NRF52_APP_END
#else
  #define APP_LIMIT       MOTA_NRF52_FS_START
#endif

// ---- platform flash / settings / gpregret abstraction --------------------------------------------
#ifdef OTA_DELTA_HOST_TEST
  extern void     otah_read(uint32_t addr, void* dst, uint32_t n);
  extern void     otah_erase(uint32_t page_addr);
  extern void     otah_write_words(uint32_t addr, const uint32_t* src, uint32_t nwords);
  extern uint32_t otah_gpregret_get(void);
  extern void     otah_gpregret_set(uint32_t v);
  extern uint16_t otah_crc16(uint32_t addr, uint32_t len);
  extern void     otah_settings_commit(uint16_t bank0, uint16_t crc, uint32_t size);
  #define APP_BASE        MOTA_NRF52_APP_BASE
  static void     fl_read(uint32_t a, void* d, uint32_t n)            { otah_read(a, d, n); }
  static void     fl_erase(uint32_t page)                            { otah_erase(page); }
  static void     fl_write_words(uint32_t a, const uint32_t* s, uint32_t nw) { otah_write_words(a, s, nw); }
  static uint32_t gpregret_get(void)                                 { return otah_gpregret_get(); }
  static void     gpregret_set(uint32_t v)                           { otah_gpregret_set(v); }
  static void     gpregret2_set(uint32_t v)                          { (void)v; }   // diag no-op on host
  static uint16_t crc16_region(uint32_t a, uint32_t len)             { return otah_crc16(a, len); }
#else
  #include "nrf.h"
  #include "nrfx_nvmc.h"
  #include "crc16.h"
  #include "boards.h"
  #include "bootloader_types.h"
  #include "bootloader_settings.h"
  #include "dfu_types.h"
  #define APP_BASE        ((uint32_t)DFU_BANK_0_REGION_START)
  // Read flash through a VOLATILE pointer. In-place apply WRITES flash (nrfx_nvmc_words_write) and then
  // READS IT BACK here (decode readback + the post-apply sha256). Those touch the same flash through two
  // different pointer provenances (an integer-cast read pointer vs the nrfx write), so whole-program -flto
  // alias analysis concludes they can't alias and caches/reorders a STALE read - the post-check then hashes
  // pre-decode bytes -> mismatch -> apply silently refused. (-fno-strict-aliasing does NOT help: this is
  // provenance, not type-based aliasing.) The host harness can't reproduce it: there read+write hit the
  // same C array, an obvious alias. volatile forces the actual load each time.
  static void     fl_read(uint32_t a, void* d, uint32_t n) {
    const volatile uint8_t* s = (const volatile uint8_t*)(uintptr_t)a; uint8_t* o = (uint8_t*)d;
    for (uint32_t i = 0; i < n; i++) o[i] = s[i];
  }
  static void     fl_erase(uint32_t page)                            { nrfx_nvmc_page_erase(page); }
  static void     fl_write_words(uint32_t a, const uint32_t* s, uint32_t nw) { nrfx_nvmc_words_write(a, s, nw); }
  static uint32_t gpregret_get(void)                                 { return NRF_POWER->GPREGRET; }
  static void     gpregret_set(uint32_t v)                           { NRF_POWER->GPREGRET = v; }
  // Diagnostic: stash an apply bail/progress code in GPREGRET2 (retained across the boot to the app, which
  // reads it back). SD is off in the bootloader, so a direct write is fine.
  static void     gpregret2_set(uint32_t v)                          { NRF_POWER->GPREGRET2 = v; }
  static uint16_t crc16_region(uint32_t a, uint32_t len)             { return crc16_compute((const uint8_t*)(uintptr_t)a, len, NULL); }
  static void otah_settings_commit(uint16_t bank0, uint16_t crc, uint32_t size) {
    bootloader_settings_t s; const bootloader_settings_t* cur;
    bootloader_util_settings_get(&cur); memcpy(&s, cur, sizeof(s));
    s.bank_0 = bank0; s.bank_0_crc = crc; s.bank_0_size = size;
    nrfx_nvmc_page_erase(BOOTLOADER_SETTINGS_ADDRESS);
    nrfx_nvmc_words_write(BOOTLOADER_SETTINGS_ADDRESS, (const uint32_t*)&s, sizeof(s) / 4);
  }
  #define BANK_VALID_APP_V  0x01u
  #define BANK_INVALID_APP_V 0xFFu
#endif
#ifdef OTA_DELTA_HOST_TEST
  #define BANK_VALID_APP_V  0x01u
  #define BANK_INVALID_APP_V 0xFFu
#endif

