mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
  // Verify the complete SD payload before the first destructive flash write.
  uint8_t h[32];
  if (!sha256_staged_region(m->payload_addr, m->payload_size, h) ||
      memcmp(h, m->image_hash, sizeof(h)) != 0) {
    gpregret2_set(0xBA);
    return false;
  }

  inherited_watchdog_feed();
  otah_settings_commit(BANK_INVALID_APP_V, 0, 0);
  clear_approval(m);
  g_cache_page = 0;
  g_cache_dirty = 0;

  for (uint32_t off = 0; off < m->image_size; off += PAGE) {
    inherited_watchdog_feed();
    uint32_t n = m->image_size - off;
    if (n > PAGE) n = PAGE;
    memset(g_cache, 0xFF, PAGE);
    if (!staged_read(m->payload_addr + off, g_cache, n)) {
      gpregret2_set(0xBB);
      return false;
    }
    fl_erase(APP_BASE + off);
    inherited_watchdog_feed();
    fl_write_words(APP_BASE + off, (const uint32_t*)g_cache, PAGE / 4);
  }

  sha256_region(APP_BASE, m->image_size, h);
  if (memcmp(h, m->image_hash, sizeof(h)) != 0) {
    gpregret2_set(0xB7);
    return false;
  }
  inherited_watchdog_feed();
  uint16_t image_crc = crc16_region(APP_BASE, m->image_size);
  inherited_watchdog_feed();
  otah_settings_commit(BANK_VALID_APP_V, image_crc, m->image_size);
  gpregret2_set(0xB8);
  return true;
}
#endif

static bool finish_apply(bool result) {
#if defined(MOTA_SD_CARD)
  // A rejected handoff falls through to the application without a hardware
  // reset, so do not leave SPIM2 or the SD pins owned by the bootloader.
  ota_sd_deinit();
#endif
  return result;
}

bool ota_delta_check_and_apply(void) {
  inherited_watchdog_feed();
  // Force a volatile read of the capability marker so -flto / --gc-sections cannot fold the reference away
  // and drop it - the running app scans the bootloader flash for it (ota_bl_info.h / OtaBlInfo.h).
  volatile uint8_t keep = *(const volatile uint8_t*)&g_mota_bl_info.magic[0];
  if (keep == 0) return finish_apply(false);        // 'M' (0x4D) != 0, so never taken; keeps the marker live
  // ---- DIAGNOSTIC: stash a bail/progress code in GPREGRET2; the app reads it back into `ota status`.
  // 0xB0 entered (pre-gate) | 0xB1 gate passed (GPREGRET was 0x6A) | 0xB2 no/unapproved mota |
  // 0xB3 bad full/codec | 0xB4 no body_len | 0xB5 base mismatch | 0xB9 bad detools geometry |
  // 0xBA SD full pre-hash mismatch | 0xBB SD read failure |
  // 0x9N detools err N | 0xB6 wrong size | 0xB7 result-hash mismatch | 0xB8 SUCCESS.
  // If status shows 0xB0 -> GPREGRET wasn't 0x6A at the bootloader.
  gpregret2_set(0xB0);
  if (gpregret_get() != GPREGRET_OTA_APPLY) return finish_apply(false);
  gpregret_set(0);                                  // consume the trigger so we never loop
  gpregret2_set(0xB1);

  struct mota_min m;
  uint32_t mota_addr = scan_mota(&m);
  if (!mota_addr || !m.approved) { gpregret2_set(0xB2); return finish_apply(false); } // nothing staged / unapproved

#if defined(MOTA_SD_CARD)
  if (m.is_full) return finish_apply(apply_full_sd(&m));
#endif

  // base check (non-destructive): the running image's body must hash to the delta's base_hash.
  // Any pre-apply rejection clears the approval (this `.mota` is not applicable) and boots normally.
  uint32_t body_len;
  uint8_t base32[32];
  if (m.is_full || m.codec_id != CODEC_INPLACE ||
      m.image_size == 0 || m.image_size > APP_LIMIT - APP_BASE) {
    gpregret2_set(0xB3); goto reject;
  }
  if (!find_body_len(&body_len))                { gpregret2_set(0xB4); goto reject; }
  sha256_region(APP_BASE, body_len, base32);
  if (memcmp(base32, m.base_hash, 8) != 0)      { gpregret2_set(0xB5); goto reject; }   // wrong base
#if defined(MOTA_SD_CARD)
  const uint32_t workspace_span = APP_LIMIT - APP_BASE;
#else
  const uint32_t workspace_span = mota_addr - APP_BASE;
#endif
  if (!dt_geometry_ok(&m, body_len, workspace_span)) {
    gpregret2_set(0xB9); goto reject;
  }

  // Commit point: make every subsequent reset enter DFU BEFORE the first destructive application write.
  // This is essential for UF2-installed apps, whose zero CRC otherwise makes a partial image bootable.
  inherited_watchdog_feed();
  otah_settings_commit(BANK_INVALID_APP_V, 0, 0);

  // Consume approval before applying so a failed patch is never retried automatically.
  clear_approval(&m);

  struct apply_ctx c;
  c.patch_addr = m.payload_addr; c.patch_len = m.payload_size; c.patch_pos = 0;
  c.ws_lo = APP_BASE;
#if defined(MOTA_SD_CARD)
  c.ws_hi = APP_LIMIT;                                  // patch is off-chip; whole app region is workspace
#else
  c.ws_hi = mota_addr;                                  // workspace stays strictly below internal mota
#endif
  c.step = 0;
  int r = detools_apply_patch_in_place_callbacks(dt_mr, dt_mw, dt_me, dt_ss, dt_sg, dt_pr,
                                                 (size_t)m.payload_size, &c);
  cache_flush();
  if (r < 0) { gpregret2_set(0x90 | ((uint32_t)(-r) & 0x0F)); return finish_apply(false); }
  if ((uint32_t)r != m.image_size) { gpregret2_set(0xB6); return finish_apply(false); }

  uint8_t h[32];
  sha256_region(APP_BASE, m.image_size, h);
  if (memcmp(h, m.image_hash, 32) != 0) { gpregret2_set(0xB7); return finish_apply(false); }

  inherited_watchdog_feed();
  uint16_t image_crc = crc16_region(APP_BASE, m.image_size);
  inherited_watchdog_feed();
  otah_settings_commit(BANK_VALID_APP_V, image_crc, m.image_size);
  gpregret2_set(0xB8);
  return finish_apply(true);

reject:
  clear_approval(&m);
  return finish_apply(false);
}
